GopalSaraf/Practicals/PSDL/include/proc/pic18lf65k40.h
// Register: CK1PPS
#define CK1PPS CK1PPS
extern volatile unsigned char           CK1PPS              __at(0xE10);
#ifndef _LIB_BUILD
asm("CK1PPS equ 0E10h");
#endif
// aliases
extern volatile unsigned char           TX1PPS              __at(0xE10);
#ifndef _LIB_BUILD
asm("TX1PPS equ 0E10h");
#endif
extern volatile unsigned char           CKPPS               __at(0xE10);
#ifndef _LIB_BUILD
asm("CKPPS equ 0E10h");
#endif
extern volatile unsigned char           TXPPS               __at(0xE10);
#ifndef _LIB_BUILD
asm("TXPPS equ 0E10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TX1PPS                 :6;
    };
    struct {
        unsigned TX1PPS0                :1;
        unsigned TX1PPS1                :1;
        unsigned TX1PPS2                :1;
        unsigned TX1PPS3                :1;
        unsigned TX1PPS4                :1;
    };
} CK1PPSbits_t;
extern volatile CK1PPSbits_t CK1PPSbits __at(0xE10);
// bitfield macros
#define _CK1PPS_PIN_POSN                                    0x0
#define _CK1PPS_PIN_POSITION                                0x0
#define _CK1PPS_PIN_SIZE                                    0x3
#define _CK1PPS_PIN_LENGTH                                  0x3
#define _CK1PPS_PIN_MASK                                    0x7
#define _CK1PPS_PORT_POSN                                   0x3
#define _CK1PPS_PORT_POSITION                               0x3
#define _CK1PPS_PORT_SIZE                                   0x2
#define _CK1PPS_PORT_LENGTH                                 0x2
#define _CK1PPS_PORT_MASK                                   0x18
#define _CK1PPS_TX1PPS_POSN                                 0x0
#define _CK1PPS_TX1PPS_POSITION                             0x0
#define _CK1PPS_TX1PPS_SIZE                                 0x6
#define _CK1PPS_TX1PPS_LENGTH                               0x6
#define _CK1PPS_TX1PPS_MASK                                 0x3F
#define _CK1PPS_TX1PPS0_POSN                                0x0
#define _CK1PPS_TX1PPS0_POSITION                            0x0
#define _CK1PPS_TX1PPS0_SIZE                                0x1
#define _CK1PPS_TX1PPS0_LENGTH                              0x1
#define _CK1PPS_TX1PPS0_MASK                                0x1
#define _CK1PPS_TX1PPS1_POSN                                0x1
#define _CK1PPS_TX1PPS1_POSITION                            0x1
#define _CK1PPS_TX1PPS1_SIZE                                0x1
#define _CK1PPS_TX1PPS1_LENGTH                              0x1
#define _CK1PPS_TX1PPS1_MASK                                0x2
#define _CK1PPS_TX1PPS2_POSN                                0x2
#define _CK1PPS_TX1PPS2_POSITION                            0x2
#define _CK1PPS_TX1PPS2_SIZE                                0x1
#define _CK1PPS_TX1PPS2_LENGTH                              0x1
#define _CK1PPS_TX1PPS2_MASK                                0x4
#define _CK1PPS_TX1PPS3_POSN                                0x3
#define _CK1PPS_TX1PPS3_POSITION                            0x3
#define _CK1PPS_TX1PPS3_SIZE                                0x1
#define _CK1PPS_TX1PPS3_LENGTH                              0x1
#define _CK1PPS_TX1PPS3_MASK                                0x8
#define _CK1PPS_TX1PPS4_POSN                                0x4
#define _CK1PPS_TX1PPS4_POSITION                            0x4
#define _CK1PPS_TX1PPS4_SIZE                                0x1
#define _CK1PPS_TX1PPS4_LENGTH                              0x1
#define _CK1PPS_TX1PPS4_MASK                                0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TX1PPS                 :6;
    };
    struct {
        unsigned TX1PPS0                :1;
        unsigned TX1PPS1                :1;
        unsigned TX1PPS2                :1;
        unsigned TX1PPS3                :1;
        unsigned TX1PPS4                :1;
    };
} TX1PPSbits_t;
extern volatile TX1PPSbits_t TX1PPSbits __at(0xE10);
// bitfield macros
#define _TX1PPS_PIN_POSN                                    0x0
#define _TX1PPS_PIN_POSITION                                0x0
#define _TX1PPS_PIN_SIZE                                    0x3
#define _TX1PPS_PIN_LENGTH                                  0x3
#define _TX1PPS_PIN_MASK                                    0x7
#define _TX1PPS_PORT_POSN                                   0x3
#define _TX1PPS_PORT_POSITION                               0x3
#define _TX1PPS_PORT_SIZE                                   0x2
#define _TX1PPS_PORT_LENGTH                                 0x2
#define _TX1PPS_PORT_MASK                                   0x18
#define _TX1PPS_TX1PPS_POSN                                 0x0
#define _TX1PPS_TX1PPS_POSITION                             0x0
#define _TX1PPS_TX1PPS_SIZE                                 0x6
#define _TX1PPS_TX1PPS_LENGTH                               0x6
#define _TX1PPS_TX1PPS_MASK                                 0x3F
#define _TX1PPS_TX1PPS0_POSN                                0x0
#define _TX1PPS_TX1PPS0_POSITION                            0x0
#define _TX1PPS_TX1PPS0_SIZE                                0x1
#define _TX1PPS_TX1PPS0_LENGTH                              0x1
#define _TX1PPS_TX1PPS0_MASK                                0x1
#define _TX1PPS_TX1PPS1_POSN                                0x1
#define _TX1PPS_TX1PPS1_POSITION                            0x1
#define _TX1PPS_TX1PPS1_SIZE                                0x1
#define _TX1PPS_TX1PPS1_LENGTH                              0x1
#define _TX1PPS_TX1PPS1_MASK                                0x2
#define _TX1PPS_TX1PPS2_POSN                                0x2
#define _TX1PPS_TX1PPS2_POSITION                            0x2
#define _TX1PPS_TX1PPS2_SIZE                                0x1
#define _TX1PPS_TX1PPS2_LENGTH                              0x1
#define _TX1PPS_TX1PPS2_MASK                                0x4
#define _TX1PPS_TX1PPS3_POSN                                0x3
#define _TX1PPS_TX1PPS3_POSITION                            0x3
#define _TX1PPS_TX1PPS3_SIZE                                0x1
#define _TX1PPS_TX1PPS3_LENGTH                              0x1
#define _TX1PPS_TX1PPS3_MASK                                0x8
#define _TX1PPS_TX1PPS4_POSN                                0x4
#define _TX1PPS_TX1PPS4_POSITION                            0x4
#define _TX1PPS_TX1PPS4_SIZE                                0x1
#define _TX1PPS_TX1PPS4_LENGTH                              0x1
#define _TX1PPS_TX1PPS4_MASK                                0x10
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TX1PPS                 :6;
    };
    struct {
        unsigned TX1PPS0                :1;
        unsigned TX1PPS1                :1;
        unsigned TX1PPS2                :1;
        unsigned TX1PPS3                :1;
        unsigned TX1PPS4                :1;
    };
} CKPPSbits_t;
extern volatile CKPPSbits_t CKPPSbits __at(0xE10);
// bitfield macros
#define _CKPPS_PIN_POSN                                     0x0
#define _CKPPS_PIN_POSITION                                 0x0
#define _CKPPS_PIN_SIZE                                     0x3
#define _CKPPS_PIN_LENGTH                                   0x3
#define _CKPPS_PIN_MASK                                     0x7
#define _CKPPS_PORT_POSN                                    0x3
#define _CKPPS_PORT_POSITION                                0x3
#define _CKPPS_PORT_SIZE                                    0x2
#define _CKPPS_PORT_LENGTH                                  0x2
#define _CKPPS_PORT_MASK                                    0x18
#define _CKPPS_TX1PPS_POSN                                  0x0
#define _CKPPS_TX1PPS_POSITION                              0x0
#define _CKPPS_TX1PPS_SIZE                                  0x6
#define _CKPPS_TX1PPS_LENGTH                                0x6
#define _CKPPS_TX1PPS_MASK                                  0x3F
#define _CKPPS_TX1PPS0_POSN                                 0x0
#define _CKPPS_TX1PPS0_POSITION                             0x0
#define _CKPPS_TX1PPS0_SIZE                                 0x1
#define _CKPPS_TX1PPS0_LENGTH                               0x1
#define _CKPPS_TX1PPS0_MASK                                 0x1
#define _CKPPS_TX1PPS1_POSN                                 0x1
#define _CKPPS_TX1PPS1_POSITION                             0x1
#define _CKPPS_TX1PPS1_SIZE                                 0x1
#define _CKPPS_TX1PPS1_LENGTH                               0x1
#define _CKPPS_TX1PPS1_MASK                                 0x2
#define _CKPPS_TX1PPS2_POSN                                 0x2
#define _CKPPS_TX1PPS2_POSITION                             0x2
#define _CKPPS_TX1PPS2_SIZE                                 0x1
#define _CKPPS_TX1PPS2_LENGTH                               0x1
#define _CKPPS_TX1PPS2_MASK                                 0x4
#define _CKPPS_TX1PPS3_POSN                                 0x3
#define _CKPPS_TX1PPS3_POSITION                             0x3
#define _CKPPS_TX1PPS3_SIZE                                 0x1
#define _CKPPS_TX1PPS3_LENGTH                               0x1
#define _CKPPS_TX1PPS3_MASK                                 0x8
#define _CKPPS_TX1PPS4_POSN                                 0x4
#define _CKPPS_TX1PPS4_POSITION                             0x4
#define _CKPPS_TX1PPS4_SIZE                                 0x1
#define _CKPPS_TX1PPS4_LENGTH                               0x1
#define _CKPPS_TX1PPS4_MASK                                 0x10
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TX1PPS                 :6;
    };
    struct {
        unsigned TX1PPS0                :1;
        unsigned TX1PPS1                :1;
        unsigned TX1PPS2                :1;
        unsigned TX1PPS3                :1;
        unsigned TX1PPS4                :1;
    };
} TXPPSbits_t;
extern volatile TXPPSbits_t TXPPSbits __at(0xE10);
// bitfield macros
#define _TXPPS_PIN_POSN                                     0x0
#define _TXPPS_PIN_POSITION                                 0x0
#define _TXPPS_PIN_SIZE                                     0x3
#define _TXPPS_PIN_LENGTH                                   0x3
#define _TXPPS_PIN_MASK                                     0x7
#define _TXPPS_PORT_POSN                                    0x3
#define _TXPPS_PORT_POSITION                                0x3
#define _TXPPS_PORT_SIZE                                    0x2
#define _TXPPS_PORT_LENGTH                                  0x2
#define _TXPPS_PORT_MASK                                    0x18
#define _TXPPS_TX1PPS_POSN                                  0x0
#define _TXPPS_TX1PPS_POSITION                              0x0
#define _TXPPS_TX1PPS_SIZE                                  0x6
#define _TXPPS_TX1PPS_LENGTH                                0x6
#define _TXPPS_TX1PPS_MASK                                  0x3F
#define _TXPPS_TX1PPS0_POSN                                 0x0
#define _TXPPS_TX1PPS0_POSITION                             0x0
#define _TXPPS_TX1PPS0_SIZE                                 0x1
#define _TXPPS_TX1PPS0_LENGTH                               0x1
#define _TXPPS_TX1PPS0_MASK                                 0x1
#define _TXPPS_TX1PPS1_POSN                                 0x1
#define _TXPPS_TX1PPS1_POSITION                             0x1
#define _TXPPS_TX1PPS1_SIZE                                 0x1
#define _TXPPS_TX1PPS1_LENGTH                               0x1
#define _TXPPS_TX1PPS1_MASK                                 0x2
#define _TXPPS_TX1PPS2_POSN                                 0x2
#define _TXPPS_TX1PPS2_POSITION                             0x2
#define _TXPPS_TX1PPS2_SIZE                                 0x1
#define _TXPPS_TX1PPS2_LENGTH                               0x1
#define _TXPPS_TX1PPS2_MASK                                 0x4
#define _TXPPS_TX1PPS3_POSN                                 0x3
#define _TXPPS_TX1PPS3_POSITION                             0x3
#define _TXPPS_TX1PPS3_SIZE                                 0x1
#define _TXPPS_TX1PPS3_LENGTH                               0x1
#define _TXPPS_TX1PPS3_MASK                                 0x8
#define _TXPPS_TX1PPS4_POSN                                 0x4
#define _TXPPS_TX1PPS4_POSITION                             0x4
#define _TXPPS_TX1PPS4_SIZE                                 0x1
#define _TXPPS_TX1PPS4_LENGTH                               0x1
#define _TXPPS_TX1PPS4_MASK                                 0x10

// Register: RX2PPS
#define RX2PPS RX2PPS
extern volatile unsigned char           RX2PPS              __at(0xE11);
#ifndef _LIB_BUILD
asm("RX2PPS equ 0E11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned RX2PPS                 :6;
    };
    struct {
        unsigned RX2PPS0                :1;
        unsigned RX2PPS1                :1;
        unsigned RX2PPS2                :1;
        unsigned RX2PPS3                :1;
        unsigned RX2PPS4                :1;
        unsigned RX2PPS5                :1;
    };
} RX2PPSbits_t;
extern volatile RX2PPSbits_t RX2PPSbits __at(0xE11);
// bitfield macros
#define _RX2PPS_PIN_POSN                                    0x0
#define _RX2PPS_PIN_POSITION                                0x0
#define _RX2PPS_PIN_SIZE                                    0x3
#define _RX2PPS_PIN_LENGTH                                  0x3
#define _RX2PPS_PIN_MASK                                    0x7
#define _RX2PPS_PORT_POSN                                   0x3
#define _RX2PPS_PORT_POSITION                               0x3
#define _RX2PPS_PORT_SIZE                                   0x3
#define _RX2PPS_PORT_LENGTH                                 0x3
#define _RX2PPS_PORT_MASK                                   0x38
#define _RX2PPS_RX2PPS_POSN                                 0x0
#define _RX2PPS_RX2PPS_POSITION                             0x0
#define _RX2PPS_RX2PPS_SIZE                                 0x6
#define _RX2PPS_RX2PPS_LENGTH                               0x6
#define _RX2PPS_RX2PPS_MASK                                 0x3F
#define _RX2PPS_RX2PPS0_POSN                                0x0
#define _RX2PPS_RX2PPS0_POSITION                            0x0
#define _RX2PPS_RX2PPS0_SIZE                                0x1
#define _RX2PPS_RX2PPS0_LENGTH                              0x1
#define _RX2PPS_RX2PPS0_MASK                                0x1
#define _RX2PPS_RX2PPS1_POSN                                0x1
#define _RX2PPS_RX2PPS1_POSITION                            0x1
#define _RX2PPS_RX2PPS1_SIZE                                0x1
#define _RX2PPS_RX2PPS1_LENGTH                              0x1
#define _RX2PPS_RX2PPS1_MASK                                0x2
#define _RX2PPS_RX2PPS2_POSN                                0x2
#define _RX2PPS_RX2PPS2_POSITION                            0x2
#define _RX2PPS_RX2PPS2_SIZE                                0x1
#define _RX2PPS_RX2PPS2_LENGTH                              0x1
#define _RX2PPS_RX2PPS2_MASK                                0x4
#define _RX2PPS_RX2PPS3_POSN                                0x3
#define _RX2PPS_RX2PPS3_POSITION                            0x3
#define _RX2PPS_RX2PPS3_SIZE                                0x1
#define _RX2PPS_RX2PPS3_LENGTH                              0x1
#define _RX2PPS_RX2PPS3_MASK                                0x8
#define _RX2PPS_RX2PPS4_POSN                                0x4
#define _RX2PPS_RX2PPS4_POSITION                            0x4
#define _RX2PPS_RX2PPS4_SIZE                                0x1
#define _RX2PPS_RX2PPS4_LENGTH                              0x1
#define _RX2PPS_RX2PPS4_MASK                                0x10
#define _RX2PPS_RX2PPS5_POSN                                0x5
#define _RX2PPS_RX2PPS5_POSITION                            0x5
#define _RX2PPS_RX2PPS5_SIZE                                0x1
#define _RX2PPS_RX2PPS5_LENGTH                              0x1
#define _RX2PPS_RX2PPS5_MASK                                0x20

// Register: CK2PPS
#define CK2PPS CK2PPS
extern volatile unsigned char           CK2PPS              __at(0xE12);
#ifndef _LIB_BUILD
asm("CK2PPS equ 0E12h");
#endif
// aliases
extern volatile unsigned char           TX2PPS              __at(0xE12);
#ifndef _LIB_BUILD
asm("TX2PPS equ 0E12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned TX2PPS                 :6;
    };
    struct {
        unsigned TX2PPS0                :1;
        unsigned TX2PPS1                :1;
        unsigned TX2PPS2                :1;
        unsigned TX2PPS3                :1;
        unsigned TX2PPS4                :1;
        unsigned TX2PPS5                :1;
    };
} CK2PPSbits_t;
extern volatile CK2PPSbits_t CK2PPSbits __at(0xE12);
// bitfield macros
#define _CK2PPS_PIN_POSN                                    0x0
#define _CK2PPS_PIN_POSITION                                0x0
#define _CK2PPS_PIN_SIZE                                    0x3
#define _CK2PPS_PIN_LENGTH                                  0x3
#define _CK2PPS_PIN_MASK                                    0x7
#define _CK2PPS_PORT_POSN                                   0x3
#define _CK2PPS_PORT_POSITION                               0x3
#define _CK2PPS_PORT_SIZE                                   0x3
#define _CK2PPS_PORT_LENGTH                                 0x3
#define _CK2PPS_PORT_MASK                                   0x38
#define _CK2PPS_TX2PPS_POSN                                 0x0
#define _CK2PPS_TX2PPS_POSITION                             0x0
#define _CK2PPS_TX2PPS_SIZE                                 0x6
#define _CK2PPS_TX2PPS_LENGTH                               0x6
#define _CK2PPS_TX2PPS_MASK                                 0x3F
#define _CK2PPS_TX2PPS0_POSN                                0x0
#define _CK2PPS_TX2PPS0_POSITION                            0x0
#define _CK2PPS_TX2PPS0_SIZE                                0x1
#define _CK2PPS_TX2PPS0_LENGTH                              0x1
#define _CK2PPS_TX2PPS0_MASK                                0x1
#define _CK2PPS_TX2PPS1_POSN                                0x1
#define _CK2PPS_TX2PPS1_POSITION                            0x1
#define _CK2PPS_TX2PPS1_SIZE                                0x1
#define _CK2PPS_TX2PPS1_LENGTH                              0x1
#define _CK2PPS_TX2PPS1_MASK                                0x2
#define _CK2PPS_TX2PPS2_POSN                                0x2
#define _CK2PPS_TX2PPS2_POSITION                            0x2
#define _CK2PPS_TX2PPS2_SIZE                                0x1
#define _CK2PPS_TX2PPS2_LENGTH                              0x1
#define _CK2PPS_TX2PPS2_MASK                                0x4
#define _CK2PPS_TX2PPS3_POSN                                0x3
#define _CK2PPS_TX2PPS3_POSITION                            0x3
#define _CK2PPS_TX2PPS3_SIZE                                0x1
#define _CK2PPS_TX2PPS3_LENGTH                              0x1
#define _CK2PPS_TX2PPS3_MASK                                0x8
#define _CK2PPS_TX2PPS4_POSN                                0x4
#define _CK2PPS_TX2PPS4_POSITION                            0x4
#define _CK2PPS_TX2PPS4_SIZE                                0x1
#define _CK2PPS_TX2PPS4_LENGTH                              0x1
#define _CK2PPS_TX2PPS4_MASK                                0x10
#define _CK2PPS_TX2PPS5_POSN                                0x5
#define _CK2PPS_TX2PPS5_POSITION                            0x5
#define _CK2PPS_TX2PPS5_SIZE                                0x1
#define _CK2PPS_TX2PPS5_LENGTH                              0x1
#define _CK2PPS_TX2PPS5_MASK                                0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned TX2PPS                 :6;
    };
    struct {
        unsigned TX2PPS0                :1;
        unsigned TX2PPS1                :1;
        unsigned TX2PPS2                :1;
        unsigned TX2PPS3                :1;
        unsigned TX2PPS4                :1;
        unsigned TX2PPS5                :1;
    };
} TX2PPSbits_t;
extern volatile TX2PPSbits_t TX2PPSbits __at(0xE12);
// bitfield macros
#define _TX2PPS_PIN_POSN                                    0x0
#define _TX2PPS_PIN_POSITION                                0x0
#define _TX2PPS_PIN_SIZE                                    0x3
#define _TX2PPS_PIN_LENGTH                                  0x3
#define _TX2PPS_PIN_MASK                                    0x7
#define _TX2PPS_PORT_POSN                                   0x3
#define _TX2PPS_PORT_POSITION                               0x3
#define _TX2PPS_PORT_SIZE                                   0x3
#define _TX2PPS_PORT_LENGTH                                 0x3
#define _TX2PPS_PORT_MASK                                   0x38
#define _TX2PPS_TX2PPS_POSN                                 0x0
#define _TX2PPS_TX2PPS_POSITION                             0x0
#define _TX2PPS_TX2PPS_SIZE                                 0x6
#define _TX2PPS_TX2PPS_LENGTH                               0x6
#define _TX2PPS_TX2PPS_MASK                                 0x3F
#define _TX2PPS_TX2PPS0_POSN                                0x0
#define _TX2PPS_TX2PPS0_POSITION                            0x0
#define _TX2PPS_TX2PPS0_SIZE                                0x1
#define _TX2PPS_TX2PPS0_LENGTH                              0x1
#define _TX2PPS_TX2PPS0_MASK                                0x1
#define _TX2PPS_TX2PPS1_POSN                                0x1
#define _TX2PPS_TX2PPS1_POSITION                            0x1
#define _TX2PPS_TX2PPS1_SIZE                                0x1
#define _TX2PPS_TX2PPS1_LENGTH                              0x1
#define _TX2PPS_TX2PPS1_MASK                                0x2
#define _TX2PPS_TX2PPS2_POSN                                0x2
#define _TX2PPS_TX2PPS2_POSITION                            0x2
#define _TX2PPS_TX2PPS2_SIZE                                0x1
#define _TX2PPS_TX2PPS2_LENGTH                              0x1
#define _TX2PPS_TX2PPS2_MASK                                0x4
#define _TX2PPS_TX2PPS3_POSN                                0x3
#define _TX2PPS_TX2PPS3_POSITION                            0x3
#define _TX2PPS_TX2PPS3_SIZE                                0x1
#define _TX2PPS_TX2PPS3_LENGTH                              0x1
#define _TX2PPS_TX2PPS3_MASK                                0x8
#define _TX2PPS_TX2PPS4_POSN                                0x4
#define _TX2PPS_TX2PPS4_POSITION                            0x4
#define _TX2PPS_TX2PPS4_SIZE                                0x1
#define _TX2PPS_TX2PPS4_LENGTH                              0x1
#define _TX2PPS_TX2PPS4_MASK                                0x10
#define _TX2PPS_TX2PPS5_POSN                                0x5
#define _TX2PPS_TX2PPS5_POSITION                            0x5
#define _TX2PPS_TX2PPS5_SIZE                                0x1
#define _TX2PPS_TX2PPS5_LENGTH                              0x1
#define _TX2PPS_TX2PPS5_MASK                                0x20

