GopalSaraf/Practicals/PSDL/include/proc/pic18lf65k40.h
extern volatile PIR4bits_t PIR4bits __at(0xE37);
// bitfield macros
#define _PIR4_TX3IF_POSN                                    0x0
#define _PIR4_TX3IF_POSITION                                0x0
#define _PIR4_TX3IF_SIZE                                    0x1
#define _PIR4_TX3IF_LENGTH                                  0x1
#define _PIR4_TX3IF_MASK                                    0x1
#define _PIR4_RC3IF_POSN                                    0x1
#define _PIR4_RC3IF_POSITION                                0x1
#define _PIR4_RC3IF_SIZE                                    0x1
#define _PIR4_RC3IF_LENGTH                                  0x1
#define _PIR4_RC3IF_MASK                                    0x2
#define _PIR4_TX4IF_POSN                                    0x2
#define _PIR4_TX4IF_POSITION                                0x2
#define _PIR4_TX4IF_SIZE                                    0x1
#define _PIR4_TX4IF_LENGTH                                  0x1
#define _PIR4_TX4IF_MASK                                    0x4
#define _PIR4_RC4IF_POSN                                    0x3
#define _PIR4_RC4IF_POSITION                                0x3
#define _PIR4_RC4IF_SIZE                                    0x1
#define _PIR4_RC4IF_LENGTH                                  0x1
#define _PIR4_RC4IF_MASK                                    0x8
#define _PIR4_TX5IF_POSN                                    0x4
#define _PIR4_TX5IF_POSITION                                0x4
#define _PIR4_TX5IF_SIZE                                    0x1
#define _PIR4_TX5IF_LENGTH                                  0x1
#define _PIR4_TX5IF_MASK                                    0x10
#define _PIR4_RC5IF_POSN                                    0x5
#define _PIR4_RC5IF_POSITION                                0x5
#define _PIR4_RC5IF_SIZE                                    0x1
#define _PIR4_RC5IF_LENGTH                                  0x1
#define _PIR4_RC5IF_MASK                                    0x20

// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0xE38);
#ifndef _LIB_BUILD
asm("PIR5 equ 0E38h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IF                 :1;
        unsigned TMR2IF                 :1;
        unsigned TMR3IF                 :1;
        unsigned TMR4IF                 :1;
        unsigned TMR5IF                 :1;
        unsigned TMR6IF                 :1;
        unsigned TMR7IF                 :1;
        unsigned TMR8IF                 :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0xE38);
// bitfield macros
#define _PIR5_TMR1IF_POSN                                   0x0
#define _PIR5_TMR1IF_POSITION                               0x0
#define _PIR5_TMR1IF_SIZE                                   0x1
#define _PIR5_TMR1IF_LENGTH                                 0x1
#define _PIR5_TMR1IF_MASK                                   0x1
#define _PIR5_TMR2IF_POSN                                   0x1
#define _PIR5_TMR2IF_POSITION                               0x1
#define _PIR5_TMR2IF_SIZE                                   0x1
#define _PIR5_TMR2IF_LENGTH                                 0x1
#define _PIR5_TMR2IF_MASK                                   0x2
#define _PIR5_TMR3IF_POSN                                   0x2
#define _PIR5_TMR3IF_POSITION                               0x2
#define _PIR5_TMR3IF_SIZE                                   0x1
#define _PIR5_TMR3IF_LENGTH                                 0x1
#define _PIR5_TMR3IF_MASK                                   0x4
#define _PIR5_TMR4IF_POSN                                   0x3
#define _PIR5_TMR4IF_POSITION                               0x3
#define _PIR5_TMR4IF_SIZE                                   0x1
#define _PIR5_TMR4IF_LENGTH                                 0x1
#define _PIR5_TMR4IF_MASK                                   0x8
#define _PIR5_TMR5IF_POSN                                   0x4
#define _PIR5_TMR5IF_POSITION                               0x4
#define _PIR5_TMR5IF_SIZE                                   0x1
#define _PIR5_TMR5IF_LENGTH                                 0x1
#define _PIR5_TMR5IF_MASK                                   0x10
#define _PIR5_TMR6IF_POSN                                   0x5
#define _PIR5_TMR6IF_POSITION                               0x5
#define _PIR5_TMR6IF_SIZE                                   0x1
#define _PIR5_TMR6IF_LENGTH                                 0x1
#define _PIR5_TMR6IF_MASK                                   0x20
#define _PIR5_TMR7IF_POSN                                   0x6
#define _PIR5_TMR7IF_POSITION                               0x6
#define _PIR5_TMR7IF_SIZE                                   0x1
#define _PIR5_TMR7IF_LENGTH                                 0x1
#define _PIR5_TMR7IF_MASK                                   0x40
#define _PIR5_TMR8IF_POSN                                   0x7
#define _PIR5_TMR8IF_POSITION                               0x7
#define _PIR5_TMR8IF_SIZE                                   0x1
#define _PIR5_TMR8IF_LENGTH                                 0x1
#define _PIR5_TMR8IF_MASK                                   0x80

// Register: PIR6
#define PIR6 PIR6
extern volatile unsigned char           PIR6                __at(0xE39);
#ifndef _LIB_BUILD
asm("PIR6 equ 0E39h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1GIF                :1;
        unsigned TMR3GIF                :1;
        unsigned TMR5GIF                :1;
        unsigned TMR7GIF                :1;
    };
} PIR6bits_t;
extern volatile PIR6bits_t PIR6bits __at(0xE39);
// bitfield macros
#define _PIR6_TMR1GIF_POSN                                  0x0
#define _PIR6_TMR1GIF_POSITION                              0x0
#define _PIR6_TMR1GIF_SIZE                                  0x1
#define _PIR6_TMR1GIF_LENGTH                                0x1
#define _PIR6_TMR1GIF_MASK                                  0x1
#define _PIR6_TMR3GIF_POSN                                  0x1
#define _PIR6_TMR3GIF_POSITION                              0x1
#define _PIR6_TMR3GIF_SIZE                                  0x1
#define _PIR6_TMR3GIF_LENGTH                                0x1
#define _PIR6_TMR3GIF_MASK                                  0x2
#define _PIR6_TMR5GIF_POSN                                  0x2
#define _PIR6_TMR5GIF_POSITION                              0x2
#define _PIR6_TMR5GIF_SIZE                                  0x1
#define _PIR6_TMR5GIF_LENGTH                                0x1
#define _PIR6_TMR5GIF_MASK                                  0x4
#define _PIR6_TMR7GIF_POSN                                  0x3
#define _PIR6_TMR7GIF_POSITION                              0x3
#define _PIR6_TMR7GIF_SIZE                                  0x1
#define _PIR6_TMR7GIF_LENGTH                                0x1
#define _PIR6_TMR7GIF_MASK                                  0x8

