GopalSaraf/Practicals/PSDL/include/proc/pic18lf65k40.h
extern volatile __bit                   RG6PPS3             __at(0x7443);	// @ (0xE88 * 8 + 3)
#define                                 RG6PPS3_bit         _BIT_ACCESS(RG6PPS,3)
// RG6PPS<RG6PPS4>
extern volatile __bit                   RG6PPS4             __at(0x7444);	// @ (0xE88 * 8 + 4)
#define                                 RG6PPS4_bit         _BIT_ACCESS(RG6PPS,4)
// RG6PPS<RG6PPS5>
extern volatile __bit                   RG6PPS5             __at(0x7445);	// @ (0xE88 * 8 + 5)
#define                                 RG6PPS5_bit         _BIT_ACCESS(RG6PPS,5)
// PORTG<RG7>
extern volatile __bit                   RG7                 __at(0x7C7F);	// @ (0xF8F * 8 + 7)
#define                                 RG7_bit             _BIT_ACCESS(PORTG,7)
// RG7PPS<RG7PPS0>
extern volatile __bit                   RG7PPS0             __at(0x7448);	// @ (0xE89 * 8 + 0)
#define                                 RG7PPS0_bit         _BIT_ACCESS(RG7PPS,0)
// RG7PPS<RG7PPS1>
extern volatile __bit                   RG7PPS1             __at(0x7449);	// @ (0xE89 * 8 + 1)
#define                                 RG7PPS1_bit         _BIT_ACCESS(RG7PPS,1)
// RG7PPS<RG7PPS2>
extern volatile __bit                   RG7PPS2             __at(0x744A);	// @ (0xE89 * 8 + 2)
#define                                 RG7PPS2_bit         _BIT_ACCESS(RG7PPS,2)
// RG7PPS<RG7PPS3>
extern volatile __bit                   RG7PPS3             __at(0x744B);	// @ (0xE89 * 8 + 3)
#define                                 RG7PPS3_bit         _BIT_ACCESS(RG7PPS,3)
// RG7PPS<RG7PPS4>
extern volatile __bit                   RG7PPS4             __at(0x744C);	// @ (0xE89 * 8 + 4)
#define                                 RG7PPS4_bit         _BIT_ACCESS(RG7PPS,4)
// RG7PPS<RG7PPS5>
extern volatile __bit                   RG7PPS5             __at(0x744D);	// @ (0xE89 * 8 + 5)
#define                                 RG7PPS5_bit         _BIT_ACCESS(RG7PPS,5)
// PORTH<RH0>
extern volatile __bit                   RH0                 __at(0x7C80);	// @ (0xF90 * 8 + 0)
#define                                 RH0_bit             _BIT_ACCESS(PORTH,0)
// RH0PPS<RH0PPS0>
extern volatile __bit                   RH0PPS0             __at(0x7450);	// @ (0xE8A * 8 + 0)
#define                                 RH0PPS0_bit         _BIT_ACCESS(RH0PPS,0)
// RH0PPS<RH0PPS1>
extern volatile __bit                   RH0PPS1             __at(0x7451);	// @ (0xE8A * 8 + 1)
#define                                 RH0PPS1_bit         _BIT_ACCESS(RH0PPS,1)
// RH0PPS<RH0PPS2>
extern volatile __bit                   RH0PPS2             __at(0x7452);	// @ (0xE8A * 8 + 2)
#define                                 RH0PPS2_bit         _BIT_ACCESS(RH0PPS,2)
// RH0PPS<RH0PPS3>
extern volatile __bit                   RH0PPS3             __at(0x7453);	// @ (0xE8A * 8 + 3)
#define                                 RH0PPS3_bit         _BIT_ACCESS(RH0PPS,3)
// RH0PPS<RH0PPS4>
extern volatile __bit                   RH0PPS4             __at(0x7454);	// @ (0xE8A * 8 + 4)
#define                                 RH0PPS4_bit         _BIT_ACCESS(RH0PPS,4)
// RH0PPS<RH0PPS5>
extern volatile __bit                   RH0PPS5             __at(0x7455);	// @ (0xE8A * 8 + 5)
#define                                 RH0PPS5_bit         _BIT_ACCESS(RH0PPS,5)
// PORTH<RH1>
extern volatile __bit                   RH1                 __at(0x7C81);	// @ (0xF90 * 8 + 1)
#define                                 RH1_bit             _BIT_ACCESS(PORTH,1)
// RH1PPS<RH1PPS0>
extern volatile __bit                   RH1PPS0             __at(0x7458);	// @ (0xE8B * 8 + 0)
#define                                 RH1PPS0_bit         _BIT_ACCESS(RH1PPS,0)
// RH1PPS<RH1PPS1>
extern volatile __bit                   RH1PPS1             __at(0x7459);	// @ (0xE8B * 8 + 1)
#define                                 RH1PPS1_bit         _BIT_ACCESS(RH1PPS,1)
// RH1PPS<RH1PPS2>
extern volatile __bit                   RH1PPS2             __at(0x745A);	// @ (0xE8B * 8 + 2)
#define                                 RH1PPS2_bit         _BIT_ACCESS(RH1PPS,2)
// RH1PPS<RH1PPS3>
extern volatile __bit                   RH1PPS3             __at(0x745B);	// @ (0xE8B * 8 + 3)
#define                                 RH1PPS3_bit         _BIT_ACCESS(RH1PPS,3)
// RH1PPS<RH1PPS4>
extern volatile __bit                   RH1PPS4             __at(0x745C);	// @ (0xE8B * 8 + 4)
#define                                 RH1PPS4_bit         _BIT_ACCESS(RH1PPS,4)
// RH1PPS<RH1PPS5>
extern volatile __bit                   RH1PPS5             __at(0x745D);	// @ (0xE8B * 8 + 5)
#define                                 RH1PPS5_bit         _BIT_ACCESS(RH1PPS,5)
// PORTH<RH2>
extern volatile __bit                   RH2                 __at(0x7C82);	// @ (0xF90 * 8 + 2)
#define                                 RH2_bit             _BIT_ACCESS(PORTH,2)
// RH2PPS<RH2PPS0>
extern volatile __bit                   RH2PPS0             __at(0x7460);	// @ (0xE8C * 8 + 0)
#define                                 RH2PPS0_bit         _BIT_ACCESS(RH2PPS,0)
// RH2PPS<RH2PPS1>
extern volatile __bit                   RH2PPS1             __at(0x7461);	// @ (0xE8C * 8 + 1)
#define                                 RH2PPS1_bit         _BIT_ACCESS(RH2PPS,1)
// RH2PPS<RH2PPS2>
extern volatile __bit                   RH2PPS2             __at(0x7462);	// @ (0xE8C * 8 + 2)
#define                                 RH2PPS2_bit         _BIT_ACCESS(RH2PPS,2)
// RH2PPS<RH2PPS3>
extern volatile __bit                   RH2PPS3             __at(0x7463);	// @ (0xE8C * 8 + 3)
#define                                 RH2PPS3_bit         _BIT_ACCESS(RH2PPS,3)
// RH2PPS<RH2PPS4>
extern volatile __bit                   RH2PPS4             __at(0x7464);	// @ (0xE8C * 8 + 4)
#define                                 RH2PPS4_bit         _BIT_ACCESS(RH2PPS,4)
// RH2PPS<RH2PPS5>
extern volatile __bit                   RH2PPS5             __at(0x7465);	// @ (0xE8C * 8 + 5)
#define                                 RH2PPS5_bit         _BIT_ACCESS(RH2PPS,5)
// PORTH<RH3>
extern volatile __bit                   RH3                 __at(0x7C83);	// @ (0xF90 * 8 + 3)
#define                                 RH3_bit             _BIT_ACCESS(PORTH,3)
// RH3PPS<RH3PPS0>
extern volatile __bit                   RH3PPS0             __at(0x7468);	// @ (0xE8D * 8 + 0)
#define                                 RH3PPS0_bit         _BIT_ACCESS(RH3PPS,0)
// RH3PPS<RH3PPS1>
extern volatile __bit                   RH3PPS1             __at(0x7469);	// @ (0xE8D * 8 + 1)
#define                                 RH3PPS1_bit         _BIT_ACCESS(RH3PPS,1)
// RH3PPS<RH3PPS2>
extern volatile __bit                   RH3PPS2             __at(0x746A);	// @ (0xE8D * 8 + 2)
#define                                 RH3PPS2_bit         _BIT_ACCESS(RH3PPS,2)
// RH3PPS<RH3PPS3>
extern volatile __bit                   RH3PPS3             __at(0x746B);	// @ (0xE8D * 8 + 3)
#define                                 RH3PPS3_bit         _BIT_ACCESS(RH3PPS,3)
// RH3PPS<RH3PPS4>
extern volatile __bit                   RH3PPS4             __at(0x746C);	// @ (0xE8D * 8 + 4)
#define                                 RH3PPS4_bit         _BIT_ACCESS(RH3PPS,4)
// RH3PPS<RH3PPS5>
extern volatile __bit                   RH3PPS5             __at(0x746D);	// @ (0xE8D * 8 + 5)
#define                                 RH3PPS5_bit         _BIT_ACCESS(RH3PPS,5)
// PCON0<RI>
extern volatile __bit                   RI                  __at(0x7EBA);	// @ (0xFD7 * 8 + 2)
#define                                 RI_bit              _BIT_ACCESS(PCON0,2)
// PCON0<RMCLR>
extern volatile __bit                   RMCLR               __at(0x7EBB);	// @ (0xFD7 * 8 + 3)
#define                                 RMCLR_bit           _BIT_ACCESS(PCON0,3)
// CPUDOZE<ROI>
extern volatile __bit                   ROI                 __at(0x7215);	// @ (0xE42 * 8 + 5)
#define                                 ROI_bit             _BIT_ACCESS(CPUDOZE,5)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0x7CB1);	// @ (0xF96 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SSP2CON2<RSEN2>
extern volatile __bit                   RSEN2               __at(0x76D1);	// @ (0xEDA * 8 + 1)
#define                                 RSEN2_bit           _BIT_ACCESS(SSP2CON2,1)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0x7CA2);	// @ (0xF94 * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<RW2>
extern volatile __bit                   RW2                 __at(0x76C2);	// @ (0xED8 * 8 + 2)
#define                                 RW2_bit             _BIT_ACCESS(SSP2STAT,2)
// PCON0<RWDT>
extern volatile __bit                   RWDT                __at(0x7EBC);	// @ (0xFD7 * 8 + 4)
#define                                 RWDT_bit            _BIT_ACCESS(PCON0,4)
// RX1PPS<RX1PPS0>
extern volatile __bit                   RX1PPS0             __at(0x7078);	// @ (0xE0F * 8 + 0)
#define                                 RX1PPS0_bit         _BIT_ACCESS(RX1PPS,0)
// RX1PPS<RX1PPS1>
extern volatile __bit                   RX1PPS1             __at(0x7079);	// @ (0xE0F * 8 + 1)
#define                                 RX1PPS1_bit         _BIT_ACCESS(RX1PPS,1)
// RX1PPS<RX1PPS2>
extern volatile __bit                   RX1PPS2             __at(0x707A);	// @ (0xE0F * 8 + 2)
#define                                 RX1PPS2_bit         _BIT_ACCESS(RX1PPS,2)
// RX1PPS<RX1PPS3>
extern volatile __bit                   RX1PPS3             __at(0x707B);	// @ (0xE0F * 8 + 3)
#define                                 RX1PPS3_bit         _BIT_ACCESS(RX1PPS,3)
// RX1PPS<RX1PPS4>
extern volatile __bit                   RX1PPS4             __at(0x707C);	// @ (0xE0F * 8 + 4)
#define                                 RX1PPS4_bit         _BIT_ACCESS(RX1PPS,4)
// RX2PPS<RX2PPS0>
extern volatile __bit                   RX2PPS0             __at(0x7088);	// @ (0xE11 * 8 + 0)
#define                                 RX2PPS0_bit         _BIT_ACCESS(RX2PPS,0)
// RX2PPS<RX2PPS1>
extern volatile __bit                   RX2PPS1             __at(0x7089);	// @ (0xE11 * 8 + 1)
#define                                 RX2PPS1_bit         _BIT_ACCESS(RX2PPS,1)
// RX2PPS<RX2PPS2>
extern volatile __bit                   RX2PPS2             __at(0x708A);	// @ (0xE11 * 8 + 2)
#define                                 RX2PPS2_bit         _BIT_ACCESS(RX2PPS,2)
// RX2PPS<RX2PPS3>
extern volatile __bit                   RX2PPS3             __at(0x708B);	// @ (0xE11 * 8 + 3)
#define                                 RX2PPS3_bit         _BIT_ACCESS(RX2PPS,3)
// RX2PPS<RX2PPS4>
extern volatile __bit                   RX2PPS4             __at(0x708C);	// @ (0xE11 * 8 + 4)
#define                                 RX2PPS4_bit         _BIT_ACCESS(RX2PPS,4)
// RX2PPS<RX2PPS5>
extern volatile __bit                   RX2PPS5             __at(0x708D);	// @ (0xE11 * 8 + 5)
#define                                 RX2PPS5_bit         _BIT_ACCESS(RX2PPS,5)
// RX3PPS<RX3PPS0>
extern volatile __bit                   RX3PPS0             __at(0x7098);	// @ (0xE13 * 8 + 0)
#define                                 RX3PPS0_bit         _BIT_ACCESS(RX3PPS,0)
// RX3PPS<RX3PPS1>
extern volatile __bit                   RX3PPS1             __at(0x7099);	// @ (0xE13 * 8 + 1)
#define                                 RX3PPS1_bit         _BIT_ACCESS(RX3PPS,1)
// RX3PPS<RX3PPS2>
extern volatile __bit                   RX3PPS2             __at(0x709A);	// @ (0xE13 * 8 + 2)
#define                                 RX3PPS2_bit         _BIT_ACCESS(RX3PPS,2)
// RX3PPS<RX3PPS3>
extern volatile __bit                   RX3PPS3             __at(0x709B);	// @ (0xE13 * 8 + 3)
#define                                 RX3PPS3_bit         _BIT_ACCESS(RX3PPS,3)
// RX3PPS<RX3PPS4>
extern volatile __bit                   RX3PPS4             __at(0x709C);	// @ (0xE13 * 8 + 4)
#define                                 RX3PPS4_bit         _BIT_ACCESS(RX3PPS,4)
// RX3PPS<RX3PPS5>
extern volatile __bit                   RX3PPS5             __at(0x709D);	// @ (0xE13 * 8 + 5)
#define                                 RX3PPS5_bit         _BIT_ACCESS(RX3PPS,5)
// RX4PPS<RX4PPS0>
extern volatile __bit                   RX4PPS0             __at(0x70A8);	// @ (0xE15 * 8 + 0)
#define                                 RX4PPS0_bit         _BIT_ACCESS(RX4PPS,0)
// RX4PPS<RX4PPS1>
extern volatile __bit                   RX4PPS1             __at(0x70A9);	// @ (0xE15 * 8 + 1)
#define                                 RX4PPS1_bit         _BIT_ACCESS(RX4PPS,1)
// RX4PPS<RX4PPS2>
extern volatile __bit                   RX4PPS2             __at(0x70AA);	// @ (0xE15 * 8 + 2)
#define                                 RX4PPS2_bit         _BIT_ACCESS(RX4PPS,2)
// RX4PPS<RX4PPS3>
extern volatile __bit                   RX4PPS3             __at(0x70AB);	// @ (0xE15 * 8 + 3)
#define                                 RX4PPS3_bit         _BIT_ACCESS(RX4PPS,3)
// RX4PPS<RX4PPS4>
extern volatile __bit                   RX4PPS4             __at(0x70AC);	// @ (0xE15 * 8 + 4)
#define                                 RX4PPS4_bit         _BIT_ACCESS(RX4PPS,4)
// RX5PPS<RX5PPS0>
extern volatile __bit                   RX5PPS0             __at(0x70B8);	// @ (0xE17 * 8 + 0)
#define                                 RX5PPS0_bit         _BIT_ACCESS(RX5PPS,0)
// RX5PPS<RX5PPS1>
extern volatile __bit                   RX5PPS1             __at(0x70B9);	// @ (0xE17 * 8 + 1)
#define                                 RX5PPS1_bit         _BIT_ACCESS(RX5PPS,1)
// RX5PPS<RX5PPS2>
extern volatile __bit                   RX5PPS2             __at(0x70BA);	// @ (0xE17 * 8 + 2)
#define                                 RX5PPS2_bit         _BIT_ACCESS(RX5PPS,2)
// RX5PPS<RX5PPS3>
extern volatile __bit                   RX5PPS3             __at(0x70BB);	// @ (0xE17 * 8 + 3)
#define                                 RX5PPS3_bit         _BIT_ACCESS(RX5PPS,3)
// RX5PPS<RX5PPS4>
extern volatile __bit                   RX5PPS4             __at(0x70BC);	// @ (0xE17 * 8 + 4)
#define                                 RX5PPS4_bit         _BIT_ACCESS(RX5PPS,4)
// RX5PPS<RX5PPS5>
extern volatile __bit                   RX5PPS5             __at(0x70BD);	// @ (0xE17 * 8 + 5)
#define                                 RX5PPS5_bit         _BIT_ACCESS(RX5PPS,5)
// PIE3<RXB0IE>
extern volatile __bit                   RXB0IE              __at(0x7160);	// @ (0xE2C * 8 + 0)
#define                                 RXB0IE_bit          _BIT_ACCESS(PIE3,0)
// PIE3<RXB1IE>
extern volatile __bit                   RXB1IE              __at(0x7161);	// @ (0xE2C * 8 + 1)
#define                                 RXB1IE_bit          _BIT_ACCESS(PIE3,1)
// PIE3<RXBNIE>
extern volatile __bit                   RXBNIE              __at(0x7161);	// @ (0xE2C * 8 + 1)
#define                                 RXBNIE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<RXBNIF>
extern volatile __bit                   RXBNIF              __at(0x71B1);	// @ (0xE36 * 8 + 1)
#define                                 RXBNIF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<RXBNIP>
extern volatile __bit                   RXBNIP              __at(0x7111);	// @ (0xE22 * 8 + 1)
#define                                 RXBNIP_bit          _BIT_ACCESS(IPR3,1)
// SSP1STAT<R_NOT_W1>
extern volatile __bit                   R_NOT_W1            __at(0x7CA2);	// @ (0xF94 * 8 + 2)
#define                                 R_NOT_W1_bit        _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_NOT_W2>
extern volatile __bit                   R_NOT_W2            __at(0x76C2);	// @ (0xED8 * 8 + 2)
#define                                 R_NOT_W2_bit        _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<R_W1>
extern volatile __bit                   R_W1                __at(0x7CA2);	// @ (0xF94 * 8 + 2)
#define                                 R_W1_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_W2>
extern volatile __bit                   R_W2                __at(0x76C2);	// @ (0xED8 * 8 + 2)
#define                                 R_W2_bit            _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<R_nW1>
extern volatile __bit                   R_nW1               __at(0x7CA2);	// @ (0xF94 * 8 + 2)
#define                                 R_nW1_bit           _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_nW2>
extern volatile __bit                   R_nW2               __at(0x76C2);	// @ (0xED8 * 8 + 2)
#define                                 R_nW2_bit           _BIT_ACCESS(SSP2STAT,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x725F);	// @ (0xE4B * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SCANCON0<SCANBUSY>
extern volatile __bit                   SCANBUSY            __at(0x7A7D);	// @ (0xF4F * 8 + 5)
#define                                 SCANBUSY_bit        _BIT_ACCESS(SCANCON0,5)
// SCANCON0<SCANEN>
extern volatile __bit                   SCANEN              __at(0x7A7F);	// @ (0xF4F * 8 + 7)
#define                                 SCANEN_bit          _BIT_ACCESS(SCANCON0,7)
// SCANCON0<SCANGO>
extern volatile __bit                   SCANGO              __at(0x7A7E);	// @ (0xF4F * 8 + 6)
#define                                 SCANGO_bit          _BIT_ACCESS(SCANCON0,6)
// SCANHADRL<SCANHADR0>
extern volatile __bit                   SCANHADR0           __at(0x7A60);	// @ (0xF4C * 8 + 0)
#define                                 SCANHADR0_bit       _BIT_ACCESS(SCANHADRL,0)
// SCANHADRL<SCANHADR1>
extern volatile __bit                   SCANHADR1           __at(0x7A61);	// @ (0xF4C * 8 + 1)
#define                                 SCANHADR1_bit       _BIT_ACCESS(SCANHADRL,1)
// SCANHADRH<SCANHADR10>
extern volatile __bit                   SCANHADR10          __at(0x7A6A);	// @ (0xF4D * 8 + 2)
#define                                 SCANHADR10_bit      _BIT_ACCESS(SCANHADRH,2)
// SCANHADRH<SCANHADR11>
extern volatile __bit                   SCANHADR11          __at(0x7A6B);	// @ (0xF4D * 8 + 3)
#define                                 SCANHADR11_bit      _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<SCANHADR12>
extern volatile __bit                   SCANHADR12          __at(0x7A6C);	// @ (0xF4D * 8 + 4)
#define                                 SCANHADR12_bit      _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<SCANHADR13>
extern volatile __bit                   SCANHADR13          __at(0x7A6D);	// @ (0xF4D * 8 + 5)
#define                                 SCANHADR13_bit      _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<SCANHADR14>
extern volatile __bit                   SCANHADR14          __at(0x7A6E);	// @ (0xF4D * 8 + 6)
#define                                 SCANHADR14_bit      _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<SCANHADR15>
extern volatile __bit                   SCANHADR15          __at(0x7A6F);	// @ (0xF4D * 8 + 7)
#define                                 SCANHADR15_bit      _BIT_ACCESS(SCANHADRH,7)
// SCANHADRU<SCANHADR16>
extern volatile __bit                   SCANHADR16          __at(0x7A70);	// @ (0xF4E * 8 + 0)
#define                                 SCANHADR16_bit      _BIT_ACCESS(SCANHADRU,0)
// SCANHADRU<SCANHADR17>
extern volatile __bit                   SCANHADR17          __at(0x7A71);	// @ (0xF4E * 8 + 1)
#define                                 SCANHADR17_bit      _BIT_ACCESS(SCANHADRU,1)
// SCANHADRU<SCANHADR18>
extern volatile __bit                   SCANHADR18          __at(0x7A72);	// @ (0xF4E * 8 + 2)
#define                                 SCANHADR18_bit      _BIT_ACCESS(SCANHADRU,2)
// SCANHADRU<SCANHADR19>
extern volatile __bit                   SCANHADR19          __at(0x7A73);	// @ (0xF4E * 8 + 3)
#define                                 SCANHADR19_bit      _BIT_ACCESS(SCANHADRU,3)
// SCANHADRL<SCANHADR2>
extern volatile __bit                   SCANHADR2           __at(0x7A62);	// @ (0xF4C * 8 + 2)
#define                                 SCANHADR2_bit       _BIT_ACCESS(SCANHADRL,2)
// SCANHADRU<SCANHADR20>
extern volatile __bit                   SCANHADR20          __at(0x7A74);	// @ (0xF4E * 8 + 4)
#define                                 SCANHADR20_bit      _BIT_ACCESS(SCANHADRU,4)
// SCANHADRU<SCANHADR21>
extern volatile __bit                   SCANHADR21          __at(0x7A75);	// @ (0xF4E * 8 + 5)
#define                                 SCANHADR21_bit      _BIT_ACCESS(SCANHADRU,5)
// SCANHADRL<SCANHADR3>
extern volatile __bit                   SCANHADR3           __at(0x7A63);	// @ (0xF4C * 8 + 3)
#define                                 SCANHADR3_bit       _BIT_ACCESS(SCANHADRL,3)
// SCANHADRL<SCANHADR4>
extern volatile __bit                   SCANHADR4           __at(0x7A64);	// @ (0xF4C * 8 + 4)
#define                                 SCANHADR4_bit       _BIT_ACCESS(SCANHADRL,4)
// SCANHADRL<SCANHADR5>
extern volatile __bit                   SCANHADR5           __at(0x7A65);	// @ (0xF4C * 8 + 5)
#define                                 SCANHADR5_bit       _BIT_ACCESS(SCANHADRL,5)
// SCANHADRL<SCANHADR6>
extern volatile __bit                   SCANHADR6           __at(0x7A66);	// @ (0xF4C * 8 + 6)
#define                                 SCANHADR6_bit       _BIT_ACCESS(SCANHADRL,6)
// SCANHADRL<SCANHADR7>
extern volatile __bit                   SCANHADR7           __at(0x7A67);	// @ (0xF4C * 8 + 7)
#define                                 SCANHADR7_bit       _BIT_ACCESS(SCANHADRL,7)
// SCANHADRH<SCANHADR8>
extern volatile __bit                   SCANHADR8           __at(0x7A68);	// @ (0xF4D * 8 + 0)
#define                                 SCANHADR8_bit       _BIT_ACCESS(SCANHADRH,0)
// SCANHADRH<SCANHADR9>
extern volatile __bit                   SCANHADR9           __at(0x7A69);	// @ (0xF4D * 8 + 1)
#define                                 SCANHADR9_bit       _BIT_ACCESS(SCANHADRH,1)
// PIE8<SCANIE>
extern volatile __bit                   SCANIE              __at(0x718F);	// @ (0xE31 * 8 + 7)
#define                                 SCANIE_bit          _BIT_ACCESS(PIE8,7)
// PIR8<SCANIF>
extern volatile __bit                   SCANIF              __at(0x71DF);	// @ (0xE3B * 8 + 7)
#define                                 SCANIF_bit          _BIT_ACCESS(PIR8,7)
// SCANCON0<SCANINTM>
extern volatile __bit                   SCANINTM            __at(0x7A7B);	// @ (0xF4F * 8 + 3)
#define                                 SCANINTM_bit        _BIT_ACCESS(SCANCON0,3)
// SCANCON0<SCANINVALID>
extern volatile __bit                   SCANINVALID         __at(0x7A7C);	// @ (0xF4F * 8 + 4)
#define                                 SCANINVALID_bit     _BIT_ACCESS(SCANCON0,4)
// IPR8<SCANIP>
extern volatile __bit                   SCANIP              __at(0x713F);	// @ (0xE27 * 8 + 7)
#define                                 SCANIP_bit          _BIT_ACCESS(IPR8,7)
// SCANLADRL<SCANLADR0>
extern volatile __bit                   SCANLADR0           __at(0x7A48);	// @ (0xF49 * 8 + 0)
#define                                 SCANLADR0_bit       _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<SCANLADR1>
extern volatile __bit                   SCANLADR1           __at(0x7A49);	// @ (0xF49 * 8 + 1)
#define                                 SCANLADR1_bit       _BIT_ACCESS(SCANLADRL,1)
// SCANLADRH<SCANLADR10>
extern volatile __bit                   SCANLADR10          __at(0x7A52);	// @ (0xF4A * 8 + 2)
#define                                 SCANLADR10_bit      _BIT_ACCESS(SCANLADRH,2)
// SCANLADRH<SCANLADR11>
extern volatile __bit                   SCANLADR11          __at(0x7A53);	// @ (0xF4A * 8 + 3)
#define                                 SCANLADR11_bit      _BIT_ACCESS(SCANLADRH,3)
// SCANLADRH<SCANLADR12>
extern volatile __bit                   SCANLADR12          __at(0x7A54);	// @ (0xF4A * 8 + 4)
#define                                 SCANLADR12_bit      _BIT_ACCESS(SCANLADRH,4)
// SCANLADRH<SCANLADR13>
